Catalogs/УпаковкиМаркируемогоТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>УпаковкиМаркируемогоТовара</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерУпаковки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерУпаковкиМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючУпаковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СерияНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоденДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/УпаковкиМаркируемогоТовара/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС
#Область ПрограммныйИнтерфейс

Процедура ЗарегистрироватьУпаковкиМаркируемогоТовара(ДанныеУпаковок) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЕстьПартия = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеУпаковок.Колонки, "Партия");
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ДанныеУпаковок.Номенклатура         КАК Номенклатура,
	|	ДанныеУпаковок.Серия                КАК Серия,
	|	ДанныеУпаковок.Партия               КАК Партия,
	|	ДанныеУпаковок.ГоденДо              КАК ГоденДо,
	|	ДанныеУпаковок.НомерУпаковки        КАК НомерУпаковки
	|ПОМЕСТИТЬ ДанныеУпаковок
	|ИЗ
	|	&ДанныеУпаковок КАК ДанныеУпаковок
	|ГДЕ
	|	НЕ ДанныеУпаковок.ГрупповаяУпаковка
	|";
	
	Если Не ЕстьПартия Тогда
		СхемаЗапроса = Новый СхемаЗапроса;
		СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
		ЗапросОбъект = СхемаЗапроса.ПакетЗапросов[0];
		Колонки = ЗапросОбъект.Колонки;
		Колонки.Удалить(Колонки.Индекс(Колонки.Найти("Партия")));
		ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДанныеУпаковок", ДанныеУпаковок);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
	ИнтеграцияМДЛП.ДобавитьКлючиУпаковок(Запрос.МенеджерВременныхТаблиц, "ДанныеУпаковок");
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ДанныеУпаковок.Номенклатура       КАК Номенклатура,
	|	ДанныеУпаковок.Серия              КАК СерияНоменклатуры,
	|	ДанныеУпаковок.Партия             КАК Партия,
	|	ДанныеУпаковок.НомерУпаковки      КАК НомерУпаковки,
	|	ДанныеУпаковок.ГоденДо            КАК ГоденДо,
	|	УпаковкиТовара.Ссылка             КАК УпаковкаТовара
	|ИЗ
	|	ДанныеУпаковок КАК ДанныеУпаковок
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			Справочник.УпаковкиМаркируемогоТовара КАК УпаковкиТовара
	|		ПО
	|			УпаковкиТовара.НомерУпаковки = ДанныеУпаковок.НомерУпаковки
	|			И УпаковкиТовара.КлючУпаковки  = ДанныеУпаковок.КлючУпаковки
	|			И УпаковкиТовара.ГоденДо = ДанныеУпаковок.ГоденДо
	|ГДЕ
	|	УпаковкиТовара.Ссылка ЕСТЬ NULL
	|		ИЛИ УпаковкиТовара.Номенклатура <> ДанныеУпаковок.Номенклатура
	|		ИЛИ УпаковкиТовара.СерияНоменклатуры <> ДанныеУпаковок.Серия
	|		ИЛИ УпаковкиТовара.Партия <> ДанныеУпаковок.Партия
	|";
	
	Если Не ЕстьПартия Тогда
		СхемаЗапроса = Новый СхемаЗапроса;
		СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
		ЗапросОбъект = СхемаЗапроса.ПакетЗапросов[0];
		Колонки = ЗапросОбъект.Колонки;
		Колонки.Удалить(Колонки.Индекс(Колонки.Найти("Партия")));
		Отбор = ЗапросОбъект.Операторы[0].Отбор;
		Отбор.Удалить(Отбор.Индекс(Отбор.Найти("УпаковкиТовара.Ссылка ЕСТЬ NULL
		|ИЛИ УпаковкиТовара.Номенклатура <> ДанныеУпаковок.Номенклатура
		|ИЛИ УпаковкиТовара.СерияНоменклатуры <> ДанныеУпаковок.Серия
		|ИЛИ УпаковкиТовара.Партия <> ДанныеУпаковок.Партия")));
		Отбор.Добавить("УпаковкиТовара.Ссылка ЕСТЬ NULL
		|ИЛИ УпаковкиТовара.Номенклатура <> ДанныеУпаковок.Номенклатура
		|ИЛИ УпаковкиТовара.СерияНоменклатуры <> ДанныеУпаковок.Серия");
		ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		Попытка
			
			Если ЗначениеЗаполнено(Выборка.УпаковкаТовара) Тогда
				УпаковкаТовара = Выборка.УпаковкаТовара.ПолучитьОбъект();
				ОбщегоНазначенияБольничнаяАптека.ЗаблокироватьОбъект(УпаковкаТовара);
			Иначе
				УпаковкаТовара = Справочники.УпаковкиМаркируемогоТовара.СоздатьЭлемент();
				УпаковкаТовара.НомерУпаковки = Выборка.НомерУпаковки;
				УпаковкаТовара.ГоденДо = Выборка.ГоденДо;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(УпаковкаТовара, Выборка, "Номенклатура, СерияНоменклатуры");
			Если ЕстьПартия Тогда
				УпаковкаТовара.Партия = Выборка.Партия;
			КонецЕсли;
			
			УпаковкаТовара.Записать();
			УпаковкаТовара.Разблокировать();
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ИмяСобытия = НСтр("ru = 'Регистрация упаковки маркируемого товара.'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
			МетаданныеСправочника = ПустаяСсылка().Метаданные();
			
			Текст = НСтр("ru = 'Не удалось записать элемент справочника %1 по причине:'");
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, МетаданныеСправочника.Представление());
			
			ТекстЖурналаРегистрации = Текст + Символы.ПС + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, МетаданныеСправочника, УпаковкаТовара, ТекстЖурналаРегистрации);
			
			ТекстПользователю = Текст + Символы.ПС + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			ОбщегоНазначения.СообщитьПользователю(ТекстПользователю);
			
			Возврат;
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс

#КонецЕсли
